       aaaaaIDENTIFICATION DIVISION.
       PROGRAM-ID.  DEBUG.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 NUMBER01 PIC 9(15).
       01 NUMBER02 PIC X(10).
       01 CHAR01   PIC X(10).

       PROCEDURE DIVISION.
           MOVE 12345 TO NUMBER01.

       CALL "OFDEBUG_START".
         
           MOVE '1234567890' TO NUMBER02.
           DISPLAY NUMBER01.
           DISPLAY NUMBER02.
           MOVE 'TEST' TO CHAR01.
           DISPLAY CHAR01.
           STOP RUN.
